БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ПараметрыГрузоперевозок</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.Склады</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ЖелезнодорожныеСтанции</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторДОПОГЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СкладыВременногоХранения</v8:Type>
				<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_РазмерыКонтейнеров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОфисыКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Оборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
				<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
				<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
				<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Авиалинии</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыДоговоров</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыКонтейнеров</v8:Type>
				<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
				<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДополнительныеЗначенияПараметровГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МоделиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПодразделенияКомпании</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ГруппыУслуг</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаркиТС</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.КлассификаторУпаковкиЭПД</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Пункты</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Таможни</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_ТипыТранспортныхСредств</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Аэропорты</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактнаяИнформация</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
				<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>18</v8:Digits>
					<v8:FractionDigits>4</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>600</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВариантыОтбораДляПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаОтбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПриИзменении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ДействияПриИзмененииКонтрольнойДаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕжедневныйПересчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>105</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПиктограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеОтбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеУсловногоОформления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВводаАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФормуВыбораОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяОбработкаПередНачаломВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяДатаИспользуетВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПросрочкиКонтрольнойДаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественноеПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВФормеГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкаИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграниченСпискомЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчищатьПриКопировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрОтметкиУведомления</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодготовленнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрямоеРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьПолноеЗначениеПараметра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВывода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ШаблоныСтандартныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВедомыйПараметр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКонтрольнаяДата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСсылочныйТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЧисло</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыОтбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПГ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидУсловия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыУсловийОтбораПараметров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоступноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВедущиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыУсловийОтбораПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыУсловийОтбораПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Параметр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыОтбораДляПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыОтбораДляПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтандартныйОтбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешняяОбработка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ПараметрыГрузоперевозок/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		
		Наименование = СтрЗаменить(Наименование,"""","");
		Наименование = СтрЗаменить(Наименование,"'","");
		Наименование = СтрЗаменить(Наименование,"«","");
		Наименование = СтрЗаменить(Наименование,"»","");
		Наименование = СтрЗаменить(Наименование,".","");
		Наименование = СтрЗаменить(Наименование,",","");
		Наименование = СтрЗаменить(Наименование,"(","");
		Наименование = СтрЗаменить(Наименование,")","");
		Наименование = СтрЗаменить(Наименование,"&","");
		Наименование = СтрЗаменить(Наименование,"^","");
		Наименование = СтрЗаменить(Наименование,":","");
		
		ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый()); 
		
		Если ТипЗначения.СодержитТип(Тип("Строка"))
			И ТипЗначения.КвалификаторыСтроки.Длина = 0 Тогда
			ТипЗначения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(600));
		КонецЕсли;
		
		СформироватьИдентификатор();
		
		// проверка уникальности идентификатора
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	CW_ПараметрыГрузоперевозок.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
		|ГДЕ
		|	CW_ПараметрыГрузоперевозок.Ссылка <> &Ссылка
		|	И CW_ПараметрыГрузоперевозок.Идентификатор = &Идентификатор";
		
		Запрос.УстановитьПараметр("Ссылка"			, Ссылка);
		Запрос.УстановитьПараметр("Идентификатор"	, Идентификатор);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Параметр с таким наименованием уже существует."; 
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		// если проёдена проверка уникальности - проверяем, не используется ли старый идентификатор в шаблонах
		Если (НЕ Ссылка.Пустая()) Тогда
			Если (Ссылка.Идентификатор <> Идентификатор) Тогда
				
				ОтказПриПроверке = Ложь;
				ПроверкаИспользованияИдентификатораШаблонами(ОтказПриПроверке);
				Если (ОтказПриПроверке) Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли; 
				
			КонецЕсли;	
		КонецЕсли; 
		 
		Попытка
			ЭтоЧисло = (_сф.к_ПервыйЭлемент(ТипЗначения.Типы()) = Тип("Число"));
		Исключение
			ЭтоЧисло = Ложь;
		КонецПопытки; 
		
		Попытка
			ЭтоСсылочныйТип = _сф.тип_Ссылочный(_сф.к_ПервыйЭлемент(ТипЗначения.Типы()));
		Исключение
		    ЭтоСсылочныйТип=Ложь;
		КонецПопытки; 
		
		// определяем, является ли параметр грузоперевозки ведомым
		// если есть хотя бы один параметр отбора, завязанный на другой параметр - тогда ведомый
		Если (ИспользованиеОтбора) Тогда
			
			фл = Ложь;
			Для каждого Стр Из ПараметрыОтбора Цикл
				Если Стр.ВидУсловия = Перечисления.CW_ВидыУсловийОтбораПараметров.Параметр Тогда
					фл = Истина;
					Стр.ИспользоватьПГ = Истина;
				Иначе
					Стр.ИспользоватьПГ = Ложь;
				КонецЕсли; 
			КонецЦикла;
			Если ЭтоВедомыйПараметр<>фл Тогда 
				ЭтоВедомыйПараметр=фл;
			КонецЕсли;
			
			Если (ВариантОтбора.Пустая()) Тогда
				
				ИспользованиеОтбора = Ложь;
				
			КонецЕсли; 
			
			Если (ВариантОтбора = Перечисления.CW_ВариантыОтбораДляПараметров.СтандартныйОтбор) Тогда
				
				Если (ПараметрыОтбора.Количество()=0) Тогда
					ИспользованиеОтбора = Ложь;
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ПараметрыОтбора.Очистить();
			
		КонецЕсли; 
		
		// при пометке на удаление проверим использование параметра в "Типах грузоперевозок"
		Если (ЭтотОбъект.ПометкаУдаления И НЕ Ссылка.ПометкаУдаления) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	CW_ТипыПеревозокПараметрыОбъекта.Ссылка
				|ИЗ
				|	Справочник.CW_ТипыПеревозок.ПараметрыГрузоперевозки КАК CW_ТипыПеревозокПараметрыОбъекта
				|ГДЕ
				|	CW_ТипыПеревозокПараметрыОбъекта.Параметр = &Параметр";
			Запрос.УстановитьПараметр("Параметр", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			Если ТЗ.Количество() > 0 Тогда
				Текст = "Параметр используется в типе перевозки: ";
				Для Каждого Стр из ТЗ Цикл
					Текст = Текст + Стр.Ссылка + ", ";
				КонецЦикла;	
				Текст = Сред(Текст, 1, СтрДлина(Текст) - 2);
				Сообщить(Текст + ".");
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	CW_ГрузоперевозкиПараметрыОбъекта.Ссылка
				|ИЗ
				|	Справочник.CW_Грузоперевозки.ПараметрыГрузоперевозки КАК CW_ГрузоперевозкиПараметрыОбъекта
				|ГДЕ
				|	CW_ГрузоперевозкиПараметрыОбъекта.Параметр = &Параметр";
			Запрос.УстановитьПараметр("Параметр", Ссылка);
			ТЗ = Запрос.Выполнить().Выгрузить();
			Если ТЗ.Количество() > 0 Тогда
				Текст = "Параметр используется в грузоперевозках: ";
				Для Каждого Стр из ТЗ Цикл
					Текст = Текст + Стр.Ссылка + ", ";
				КонецЦикла;	
				Текст = Сред(Текст, 1, СтрДлина(Текст) - 2);
				Сообщить(Текст + ".");
			КонецЕсли;
		КонецЕсли;	
		
		// подготавливаем формулу
		Если (ДинамическийПараметр) Тогда
			
			ТекстФормулы = Формула;
			
			// удаляем комментарии
			Строки = _сф.стр_РазбитьНаСтроки(ТекстФормулы,Символы.ПС);
			МассивСтрок = Новый Массив;
			Для Счетчик=1 По _сф.стр_ЧислоСтрок(Строки) Цикл
				
				Стр = СтрПолучитьСтроку(Строки,Счетчик);
				ПозицияКомментария = Найти(Стр,"//");
				Если (ПозицияКомментария <> 0) Тогда
					
					Стр = Лев(Стр,ПозицияКомментария-1);
					
				КонецЕсли; 
				Если (СокрЛП(Стр) <> "") Тогда
					МассивСтрок.Добавить(СокрЛП(Стр));
				КонецЕсли; 
				
			КонецЦикла; 
			
			// удаляем переводы строк
			ТекстФормулы = _сф.м_Представление(МассивСтрок,""); 
			
			ПодготовленнаяФормула = ТекстФормулы;
			//Сообщить(ПодготовленнаяФормула);
			
			// проверка признака ежедневного пересчета
			Если (НЕ ЕжедневныйПересчет) Тогда
				
				ЕжедневныйПересчет = (Найти(ПодготовленнаяФормула,"ТекущаяДата"));
				Если (НЕ ЕжедневныйПересчет) Тогда
					Для каждого Стр Из ИспользуемыеПараметры Цикл
						Если (Стр.Параметр.ЕжедневныйПересчет) Тогда
							ЕжедневныйПересчет = Истина;
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 
				
			КонецЕсли; 
			
			// формирование ТЧ задействованных параметров
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ПараметрыГрузоперевозок.Идентификатор,
			|	CW_ПараметрыГрузоперевозок.Ссылка
			|ИЗ
			|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			МассивЗадействованныхПараметров = Новый Массив;
			
			МакросыФормулы	= _сф.стр_СписокМакросов(ПодготовленнаяФормула,"{}");
			Для каждого Макрос Из МакросыФормулы Цикл
				
				ЗначениеПараметра = Неопределено;
				
				// определяем, является реквизит параметром или реквизитом
				// если есть %%, то параметр
				Если Найти(Макрос,"%")<>0 Тогда
					
					// это параметр
					Макрос = СтрЗаменить(Макрос,"%","");
					Если Найти(Макрос,".") <>0  Тогда
						
						СтруктураМакроса = _сф.ст_СоздатьИзМаркированнойСтроки(Макрос,".","Идентификатор,Значение");
						ИдентификаторМакроса = СтруктураМакроса.Идентификатор;
						ЗначениеКД = СтруктураМакроса.Значение;
						
					Иначе
						
						ИдентификаторМакроса = Макрос;
						ЗначениеКД = Неопределено;
						
					КонецЕсли; 
					
					// получаем ссылку параметра по идентификатору
					Выборка.Сбросить();
					Если Выборка.НайтиСледующий(Новый Структура("Идентификатор",ИдентификаторМакроса)) Тогда
						_сф.м_ДобавитьУникально(МассивЗадействованныхПараметров,Выборка.Ссылка);
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			ИспользуемыеПараметры.Очистить();
			Для каждого Стр Из МассивЗадействованныхПараметров Цикл
				
				Нстр = ИспользуемыеПараметры.Добавить();
				Нстр.Параметр = Стр;
				
			КонецЦикла; 
			
			ОчищатьПриКопировании = Истина;
			
		Иначе
			
			ЕжедневныйПересчет = Ложь;
			
		КонецЕсли; 
		
		ТипИзменен = ТипЗначения <> Ссылка.ТипЗначения;
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ТипИзменен", ТипИзменен);
		Если ТипИзменен Тогда
			_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ПредставлениеТипа", Строка(Ссылка.ТипЗначения));
		КонецЕсли; 
		
		
	КонецЕсли; 
	
	Если ЭтоГруппа Тогда
		
		ИндексПиктограммы = 0;
		
	Иначе
		
		Если ДинамическийПараметр Тогда
			
			ИндексПиктограммы = 3;
			
		ИначеЕсли ЭтоКонтрольнаяДата Тогда 
			
			ИндексПиктограммы = 2;
			
		Иначе
			
			ИндексПиктограммы = 1;
			
		КонецЕсли; 
		
		ИспользуютсяДополнительныеЗначения = ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.CW_ДополнительныеЗначенияПараметровГрузоперевозок");
		
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		//При записи нвого объепкта обновляем повторные значения,
		//которые используются при заполнени списка колонок
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьИдентификатор() Экспорт 
	
	Если ЭтоКонтрольнаяДата Тогда
		
		Идентификатор = "(кд) "+СокрЛП(Наименование);
		ИдентификаторПлан = Идентификатор + "_ЗначениеПлан";
		ИдентификаторФакт = Идентификатор + "_ЗначениеФакт";

		Если (КонтрольнаяДатаИспользуетВремя) Тогда
			ТипЗначения = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		Иначе
			ТипЗначения = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));	
		КонецЕсли; 
		
	Иначе
		
		Идентификатор = "(пг) "+СокрЛП(Наименование);
		ИдентификаторПлан = "";
		ИдентификаторФакт = "";
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ПроверкаИспользованияИдентификатораШаблонами(ПеременнаяОтказ)
	
	СтарыйШаблон = "%"+Ссылка.Идентификатор+"%";
	НовыйШаблон = "%"+Идентификатор+"%";
	
	// проверяем регистр "Шаблоны номенклатуры"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ШаблоныУслуг.Номенклатура,
	|	CW_ШаблоныУслуг.Договор,
	|	CW_ШаблоныУслуг.РасходнаяСтатья,
	|	CW_ШаблоныУслуг.ДоходнаяСтатья
	|ИЗ
	|	РегистрСведений.CW_ШаблоныУслуг КАК CW_ШаблоныУслуг
	|ГДЕ
	|	(CW_ШаблоныУслуг.Шаблон ПОДОБНО &Шаблон
	|			ИЛИ CW_ШаблоныУслуг.ШаблонАнглийский ПОДОБНО &Шаблон)";
	Запрос.УстановитьПараметр("Шаблон", СтарыйШаблон);
	
	Выборка 		= Запрос.Выполнить().Выбрать();
	МенеджерЗаписи 	= РегистрыСведений.CW_ШаблоныУслуг.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		
		// получаем запись
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.Шаблон 			= СтрЗаменить(МенеджерЗаписи.Шаблон,			СтарыйШаблон, НовыйШаблон);
		МенеджерЗаписи.ШаблонАнглийский = СтрЗаменить(МенеджерЗаписи.ШаблонАнглийский,	СтарыйШаблон, НовыйШаблон);
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла; 
	
	// проверяем справочник "Варианты свёртки табличных частей"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Ссылка
	               |ПОМЕСТИТЬ выборка
	               |ИЗ
	               |	Справочник.CW_ВариантыСверткиТабличныхЧастей.НоменклатураСвертки КАК CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки
	               |ГДЕ
	               |	(CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Шаблон ПОДОБНО &Шаблон
	               |			ИЛИ CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.ШаблонАнглийский ПОДОБНО &Шаблон)
	               |	И CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	выборка.Ссылка
	               |ИЗ
	               |	выборка КАК выборка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	выборка.Ссылка";
	
	Запрос.УстановитьПараметр("Шаблон", СтарыйШаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ШаблонСвертки = Выборка.Ссылка.ПолучитьОБъект();
		
		Для каждого СтрокаТЧ Из ШаблонСвертки.НоменклатураСвертки Цикл
			СтрокаТЧ.Шаблон 			= СтрЗаменить(СтрокаТЧ.Шаблон,			СтарыйШаблон,	НовыйШаблон);
			СтрокаТЧ.ШаблонАнглийский 	= СтрЗаменить(СтрокаТЧ.ШаблонАнглийский,СтарыйШаблон,	НовыйШаблон);
		КонецЦикла; 
		
		ШаблонСвертки.Записать();
		
	КонецЦикла; 
	
	// проверяем справочник "Типы слежения"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ТипыСлеженияСтатусы.Ссылка
	               |ПОМЕСТИТЬ выборка
	               |ИЗ
	               |	Справочник.CW_ТипыСлежения.Статусы КАК CW_ТипыСлеженияСтатусы
	               |ГДЕ
	               |	CW_ТипыСлеженияСтатусы.ШаблонОписания ПОДОБНО &Шаблон
	               |	И CW_ТипыСлеженияСтатусы.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	выборка.Ссылка
	               |ИЗ
	               |	выборка КАК выборка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	выборка.Ссылка";
	
	Запрос.УстановитьПараметр("Шаблон", СтарыйШаблон);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипСлежения = Выборка.Ссылка.ПолучитьОБъект();
		Для каждого СтрокаТЧ Из ТипСлежения.Статусы Цикл
			СтрокаТЧ.ШаблонОписания = СтрЗаменить(СтрокаТЧ.ШаблонОписания,СтарыйШаблон,НовыйШаблон);
		КонецЦикла; 
		
		ТипСлежения.Записать();
		
	КонецЦикла; 
	
	// проверяем регистр "параметры договоров"
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыДоговоров.Договор,
	               |	CW_ПараметрыДоговоров.Период
	               |ИЗ
	               |	РегистрСведений.CW_ПараметрыДоговоров КАК CW_ПараметрыДоговоров
	               |ГДЕ
	               |	(CW_ПараметрыДоговоров.ПодвалВСчете ПОДОБНО &Шаблон
	               |			ИЛИ CW_ПараметрыДоговоров.ПодвалВСчетеАнгл ПОДОБНО &Шаблон
	               |			ИЛИ CW_ПараметрыДоговоров.ДополнениеВШапкеАкта ПОДОБНО &Шаблон
	               |			ИЛИ CW_ПараметрыДоговоров.ДополнениеВШапкеАктаАнгл ПОДОБНО &Шаблон)";
	
	Запрос.УстановитьПараметр("Шаблон", СтарыйШаблон);
	
	МенеджерЗаписи = РегистрыСведений.CW_ПараметрыДоговоров.СоздатьМенеджерЗаписи();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// получаем запись
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ПодвалВСчете 			= СтрЗаменить(МенеджерЗаписи.ПодвалВСчете,				СтарыйШаблон, НовыйШаблон);
		МенеджерЗаписи.ПодвалВСчетеАнгл 		= СтрЗаменить(МенеджерЗаписи.ПодвалВСчетеАнгл,			СтарыйШаблон, НовыйШаблон);
		МенеджерЗаписи.ДополнениеВШапкеАкта 	= СтрЗаменить(МенеджерЗаписи.ДополнениеВШапкеАкта,		СтарыйШаблон, НовыйШаблон);
		МенеджерЗаписи.ДополнениеВШапкеАктаАнгл = СтрЗаменить(МенеджерЗаписи.ДополнениеВШапкеАктаАнгл,	СтарыйШаблон, НовыйШаблон);
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ПризнакНового = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ЭтоНовый");
	Если ПризнакНового <> Неопределено Тогда
		
		Если ПризнакНового Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	CW_ГруппыПользователей.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.CW_ГруппыПользователей КАК CW_ГруппыПользователей
			               |ГДЕ
			               |	CW_ГруппыПользователей.ПометкаУдаления = ЛОЖЬ
			               |	И CW_ГруппыПользователей.ПолныеПрава = ЛОЖЬ
			               |	И CW_ГруппыПользователей.Предопределенный = ЛОЖЬ";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			УстановитьПривилегированныйРежим(Истина);
			Пока Выборка.Следующий() Цикл
				
				Запись = РегистрыСведений.CW_ПраваДоступаДляПараметровМониторинга.СоздатьМенеджерЗаписи();
				Запись.Параметр 		= Ссылка;
				Запись.Группа 			= Выборка.Ссылка;
				Запись.Просмотр			= Истина;
				Запись.Редактирование	= Истина;
				Запись.Записать(Истина);
				
			КонецЦикла; 
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ТипИзменен = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ТипИзменен");
	Если ТипИзменен <> Неопределено Тогда
		
		Если ТипИзменен Тогда
			
			ПредставлениеСтарогоТипа	= _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПредставлениеТипа");
			ПредставлениеНовогоТипа 	= Строка(ТипЗначения);
			Пользователь 				= CW_Настройки.Пользователь();
			
			ТекстСообщения = "Изменен тип параметра """+Строка(Ссылка)+""": "+ПредставлениеСтарогоТипа+" -> "+ПредставлениеНовогоТипа;
			ТекстСообщения = ТекстСообщения + Символы.ПС+ "Пользователь: "+Строка(Пользователь);
			
			МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(Ссылка);
			МассивСсылок.Добавить(Пользователь);
			
			CW_Журнал.ЗаписатьСообщение("Общие.КонтрольПараметров","info",ТекстСообщения,МассивСсылок);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	//Установка типа параметра при копировании
	ТипЗначения = ОбъектКопирования.ТипЗначения;
	
КонецПроцедуры

#КонецЕсли
